20220621/Documents/тм_ВыплатаЗарплатыПоЗаказНаряду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>тм_ВыплатаЗарплатыПоЗаказНаряду</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.тм_ЗарплатаПоЗаказНарядам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

20220621/AccumulationRegisters/тм_ЗарплатаПоЗаказНарядам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>тм_ЗарплатаПоЗаказНарядам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

20220621/Documents/тм_ВыплатаЗарплатыПоЗаказНаряду/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
		
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли; 

	ПроверитьОстаткиСуммы(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьДвижения();

КонецПроцедуры

Процедура ПроверитьОстаткиСуммы(Отказ)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.тм_ЗарплатаПоЗаказНарядам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.УстановитьЗначение("Сотрудник", Сотрудник);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_ЗарплатаПоЗаказНарядамОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.тм_ЗарплатаПоЗаказНарядам.Остатки(
		|			&ГраницаДок,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК тм_ЗарплатаПоЗаказНарядамОстатки";
	
	Запрос.УстановитьПараметр("ГраницаДок", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Сумма > Выборка.СуммаОстаток Тогда
		ТекстСообщения = СтрШаблон("Не хватает суммы выплаты. Допустимая сумма = %1", Выборка.СуммаОстаток);
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли; 

КонецПроцедуры
                
Процедура ЗаполнитьДвижения()
	
	Движения.тм_ЗарплатаПоЗаказНарядам.Записывать = Истина;
	Движение = Движения.тм_ЗарплатаПоЗаказНарядам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;
	Движение.Сумма = Сумма;
	Движение.Комментарий = Комментарий;

КонецПроцедуры
